{
    "query": "2 Samuel 1–2; 1 Chronicles 11; Psalm 96; Psalm 106; Acts 21",
    "canonical": "2 Samuel 1–2; 1 Chronicles 11; Psalm 96; Psalm 106; Acts 21",
    "parsed": [
        [
            10001001,
            10002032
        ],
        [
            13011001,
            13011047
        ],
        [
            19096001,
            19096013
        ],
        [
            19106001,
            19106048
        ],
        [
            44021001,
            44021040
        ]
    ],
    "passage_meta": [
        {
            "canonical": "2 Samuel 1–2",
            "chapter_start": [
                10001001,
                10001027
            ],
            "chapter_end": [
                10002001,
                10002032
            ],
            "prev_verse": 9031013,
            "next_verse": 10003001,
            "prev_chapter": [
                9031001,
                9031013
            ],
            "next_chapter": [
                10003001,
                10003039
            ]
        },
        {
            "canonical": "1 Chronicles 11",
            "chapter_start": [
                13011001,
                13011047
            ],
            "chapter_end": [
                13011001,
                13011047
            ],
            "prev_verse": 13010014,
            "next_verse": 13012001,
            "prev_chapter": [
                13010001,
                13010014
            ],
            "next_chapter": [
                13012001,
                13012040
            ]
        },
        {
            "canonical": "Psalm 96",
            "chapter_start": [
                19096001,
                19096013
            ],
            "chapter_end": [
                19096001,
                19096013
            ],
            "prev_verse": 19095011,
            "next_verse": 19097001,
            "prev_chapter": [
                19095001,
                19095011
            ],
            "next_chapter": [
                19097001,
                19097012
            ]
        },
        {
            "canonical": "Psalm 106",
            "chapter_start": [
                19106001,
                19106048
            ],
            "chapter_end": [
                19106001,
                19106048
            ],
            "prev_verse": 19105045,
            "next_verse": 19107001,
            "prev_chapter": [
                19105001,
                19105045
            ],
            "next_chapter": [
                19107001,
                19107043
            ]
        },
        {
            "canonical": "Acts 21",
            "chapter_start": [
                44021001,
                44021040
            ],
            "chapter_end": [
                44021001,
                44021040
            ],
            "prev_verse": 44020038,
            "next_verse": 44022001,
            "prev_chapter": [
                44020001,
                44020038
            ],
            "next_chapter": [
                44022001,
                44022030
            ]
        }
    ],
    "passages": [
        "2 Samuel 1–2\n\nDavid Hears of Saul’s Death\n\n  [1] After the death of Saul, when David had returned from striking down the Amalekites, David remained two days in Ziklag. [2] And on the third day, behold, a man came from Saul’s camp, with his clothes torn and dirt on his head. And when he came to David, he fell to the ground and paid homage. [3] David said to him, “Where do you come from?” And he said to him, “I have escaped from the camp of Israel.” [4] And David said to him, “How did it go? Tell me.” And he answered, “The people fled from the battle, and also many of the people have fallen and are dead, and Saul and his son Jonathan are also dead.” [5] Then David said to the young man who told him, “How do you know that Saul and his son Jonathan are dead?” [6] And the young man who told him said, “By chance I happened to be on Mount Gilboa, and there was Saul leaning on his spear, and behold, the chariots and the horsemen were close upon him. [7] And when he looked behind him, he saw me, and called to me. And I answered, ‘Here I am.’ [8] And he said to me, ‘Who are you?’ I answered him, ‘I am an Amalekite.’ [9] And he said to me, ‘Stand beside me and kill me, for anguish has seized me, and yet my life still lingers.’ [10] So I stood beside him and killed him, because I was sure that he could not live after he had fallen. And I took the crown that was on his head and the armlet that was on his arm, and I have brought them here to my lord.”\n\n  [11] Then David took hold of his clothes and tore them, and so did all the men who were with him. [12] And they mourned and wept and fasted until evening for Saul and for Jonathan his son and for the people of the LORD and for the house of Israel, because they had fallen by the sword. [13] And David said to the young man who told him, “Where do you come from?” And he answered, “I am the son of a sojourner, an Amalekite.” [14] David said to him, “How is it you were not afraid to put out your hand to destroy the LORD’s anointed?” [15] Then David called one of the young men and said, “Go, execute him.” And he struck him down so that he died. [16] And David said to him, “Your blood be on your head, for your own mouth has testified against you, saying, ‘I have killed the LORD’s anointed.’”\n\nDavid’s Lament for Saul and Jonathan\n\n  [17] And David lamented with this lamentation over Saul and Jonathan his son, [18] and he said it(1) should be taught to the people of Judah; behold, it is written in the Book of Jashar.(2) He said:\n\n    [19] “Your glory, O Israel, is slain on your high places!\n        How the mighty have fallen!\n    [20] Tell it not in Gath,\n        publish it not in the streets of Ashkelon,\n    lest the daughters of the Philistines rejoice,\n        lest the daughters of the uncircumcised exult.\n    \n    \n    [21] “You mountains of Gilboa,\n        let there be no dew or rain upon you,\n        nor fields of offerings!(3)\n    For there the shield of the mighty was defiled,\n        the shield of Saul, not anointed with oil.\n    \n    \n    [22] “From the blood of the slain,\n        from the fat of the mighty,\n    the bow of Jonathan turned not back,\n        and the sword of Saul returned not empty.\n    \n    \n    [23] “Saul and Jonathan, beloved and lovely!\n        In life and in death they were not divided;\n    they were swifter than eagles;\n        they were stronger than lions.\n    \n    \n    [24] “You daughters of Israel, weep over Saul,\n        who clothed you luxuriously in scarlet,\n        who put ornaments of gold on your apparel.\n    \n    \n    [25] “How the mighty have fallen\n        in the midst of the battle!\n    \n    \n    “Jonathan lies slain on your high places.\n    [26]     I am distressed for you, my brother Jonathan;\n    very pleasant have you been to me;\n        your love to me was extraordinary,\n        surpassing the love of women.\n    \n    \n    [27] “How the mighty have fallen,\n        and the weapons of war perished!”\n    \n    \n    David Anointed King of Judah\n\n  [1] After this David inquired of the LORD, “Shall I go up into any of the cities of Judah?” And the LORD said to him, “Go up.” David said, “To which shall I go up?” And he said, “To Hebron.” [2] So David went up there, and his two wives also, Ahinoam of Jezreel and Abigail the widow of Nabal of Carmel. [3] And David brought up his men who were with him, everyone with his household, and they lived in the towns of Hebron. [4] And the men of Judah came, and there they anointed David king over the house of Judah.\n\n  When they told David, “It was the men of Jabesh-gilead who buried Saul,” [5] David sent messengers to the men of Jabesh-gilead and said to them, “May you be blessed by the LORD, because you showed this loyalty to Saul your lord and buried him. [6] Now may the LORD show steadfast love and faithfulness to you. And I will do good to you because you have done this thing. [7] Now therefore let your hands be strong, and be valiant, for Saul your lord is dead, and the house of Judah has anointed me king over them.”\n\nIsh-bosheth Made King of Israel\n\n  [8] But Abner the son of Ner, commander of Saul’s army, took Ish-bosheth the son of Saul and brought him over to Mahanaim, [9] and he made him king over Gilead and the Ashurites and Jezreel and Ephraim and Benjamin and all Israel. [10] Ish-bosheth, Saul’s son, was forty years old when he began to reign over Israel, and he reigned two years. But the house of Judah followed David. [11] And the time that David was king in Hebron over the house of Judah was seven years and six months.\n\nThe Battle of Gibeon\n\n  [12] Abner the son of Ner, and the servants of Ish-bosheth the son of Saul, went out from Mahanaim to Gibeon. [13] And Joab the son of Zeruiah and the servants of David went out and met them at the pool of Gibeon. And they sat down, the one on the one side of the pool, and the other on the other side of the pool. [14] And Abner said to Joab, “Let the young men arise and compete before us.” And Joab said, “Let them arise.” [15] Then they arose and passed over by number, twelve for Benjamin and Ish-bosheth the son of Saul, and twelve of the servants of David. [16] And each caught his opponent by the head and thrust his sword in his opponent’s side, so they fell down together. Therefore that place was called Helkath-hazzurim,(4) which is at Gibeon. [17] And the battle was very fierce that day. And Abner and the men of Israel were beaten before the servants of David.\n\n  [18] And the three sons of Zeruiah were there, Joab, Abishai, and Asahel. Now Asahel was as swift of foot as a wild gazelle. [19] And Asahel pursued Abner, and as he went, he turned neither to the right hand nor to the left from following Abner. [20] Then Abner looked behind him and said, “Is it you, Asahel?” And he answered, “It is I.” [21] Abner said to him, “Turn aside to your right hand or to your left, and seize one of the young men and take his spoil.” But Asahel would not turn aside from following him. [22] And Abner said again to Asahel, “Turn aside from following me. Why should I strike you to the ground? How then could I lift up my face to your brother Joab?” [23] But he refused to turn aside. Therefore Abner struck him in the stomach with the butt of his spear, so that the spear came out at his back. And he fell there and died where he was. And all who came to the place where Asahel had fallen and died, stood still.\n\n  [24] But Joab and Abishai pursued Abner. And as the sun was going down they came to the hill of Ammah, which lies before Giah on the way to the wilderness of Gibeon. [25] And the people of Benjamin gathered themselves together behind Abner and became one group and took their stand on the top of a hill. [26] Then Abner called to Joab, “Shall the sword devour forever? Do you not know that the end will be bitter? How long will it be before you tell your people to turn from the pursuit of their brothers?” [27] And Joab said, “As God lives, if you had not spoken, surely the men would not have given up the pursuit of their brothers until the morning.” [28] So Joab blew the trumpet, and all the men stopped and pursued Israel no more, nor did they fight anymore.\n\n  [29] And Abner and his men went all that night through the Arabah. They crossed the Jordan, and marching the whole morning, they came to Mahanaim. [30] Joab returned from the pursuit of Abner. And when he had gathered all the people together, there were missing from David’s servants nineteen men besides Asahel. [31] But the servants of David had struck down of Benjamin 360 of Abner’s men. [32] And they took up Asahel and buried him in the tomb of his father, which was at Bethlehem. And Joab and his men marched all night, and the day broke upon them at Hebron.\n\nFootnotes\n\n(1) 1:18 Septuagint; Hebrew *the Bow*, which may be the name of the lament’s tune\n\n(2) 1:18 Or *of the upright*\n\n(3) 1:21 Septuagint *firstfruits*\n\n(4) 2:16 *Helkath-hazzurim* means *the field of sword-edges*\n (ESV)",
        "1 Chronicles 11\n\nDavid Anointed King\n\n  [1] Then all Israel gathered together to David at Hebron and said, “Behold, we are your bone and flesh. [2] In times past, even when Saul was king, it was you who led out and brought in Israel. And the LORD your God said to you, ‘You shall be shepherd of my people Israel, and you shall be prince over my people Israel.’” [3] So all the elders of Israel came to the king at Hebron, and David made a covenant with them at Hebron before the LORD. And they anointed David king over Israel, according to the word of the LORD by Samuel.\n\nDavid Takes Jerusalem\n\n  [4] And David and all Israel went to Jerusalem, that is, Jebus, where the Jebusites were, the inhabitants of the land. [5] The inhabitants of Jebus said to David, “You will not come in here.” Nevertheless, David took the stronghold of Zion, that is, the city of David. [6] David said, “Whoever strikes the Jebusites first shall be chief and commander.” And Joab the son of Zeruiah went up first, so he became chief. [7] And David lived in the stronghold; therefore it was called the city of David. [8] And he built the city all around from the Millo in complete circuit, and Joab repaired the rest of the city. [9] And David became greater and greater, for the LORD of hosts was with him.\n\nDavid’s Mighty Men\n\n  [10] Now these are the chiefs of David’s mighty men, who gave him strong support in his kingdom, together with all Israel, to make him king, according to the word of the LORD concerning Israel. [11] This is an account of David’s mighty men: Jashobeam, a Hachmonite, was chief of the three.(1) He wielded his spear against 300 whom he killed at one time.\n\n  [12] And next to him among the three mighty men was Eleazar the son of Dodo, the Ahohite. [13] He was with David at Pas-dammim when the Philistines were gathered there for battle. There was a plot of ground full of barley, and the men fled from the Philistines. [14] But he took his(2) stand in the midst of the plot and defended it and killed the Philistines. And the LORD saved them by a great victory.\n\n  [15] Three of the thirty chief men went down to the rock to David at the cave of Adullam, when the army of Philistines was encamped in the Valley of Rephaim. [16] David was then in the stronghold, and the garrison of the Philistines was then at Bethlehem. [17] And David said longingly, “Oh that someone would give me water to drink from the well of Bethlehem that is by the gate!” [18] Then the three mighty men broke through the camp of the Philistines and drew water out of the well of Bethlehem that was by the gate and took it and brought it to David. But David would not drink it. He poured it out to the LORD [19] and said, “Far be it from me before my God that I should do this. Shall I drink the lifeblood of these men? For at the risk of their lives they brought it.” Therefore he would not drink it. These things did the three mighty men.\n\n  [20] Now Abishai, the brother of Joab, was chief of the thirty.(3) And he wielded his spear against 300 men and killed them and won a name beside the three. [21] He was the most renowned(4) of the thirty(5) and became their commander, but he did not attain to the three.\n\n  [22] And Benaiah the son of Jehoiada was a valiant man(6) of Kabzeel, a doer of great deeds. He struck down two heroes of Moab. He also went down and struck down a lion in a pit on a day when snow had fallen. [23] And he struck down an Egyptian, a man of great stature, five cubits(7) tall. The Egyptian had in his hand a spear like a weaver’s beam, but Benaiah went down to him with a staff and snatched the spear out of the Egyptian’s hand and killed him with his own spear. [24] These things did Benaiah the son of Jehoiada and won a name beside the three mighty men. [25] He was renowned among the thirty, but he did not attain to the three. And David set him over his bodyguard.\n\n  [26] The mighty men were Asahel the brother of Joab, Elhanan the son of Dodo of Bethlehem, [27] Shammoth of Harod,(8) Helez the Pelonite, [28] Ira the son of Ikkesh of Tekoa, Abiezer of Anathoth, [29] Sibbecai the Hushathite, Ilai the Ahohite, [30] Maharai of Netophah, Heled the son of Baanah of Netophah, [31] Ithai the son of Ribai of Gibeah of the people of Benjamin, Benaiah of Pirathon, [32] Hurai of the brooks of Gaash, Abiel the Arbathite, [33] Azmaveth of Baharum, Eliahba the Shaalbonite, [34] Hashem(9) the Gizonite, Jonathan the son of Shagee the Hararite, [35] Ahiam the son of Sachar the Hararite, Eliphal the son of Ur, [36] Hepher the Mecherathite, Ahijah the Pelonite, [37] Hezro of Carmel, Naarai the son of Ezbai, [38] Joel the brother of Nathan, Mibhar the son of Hagri, [39] Zelek the Ammonite, Naharai of Beeroth, the armor-bearer of Joab the son of Zeruiah, [40] Ira the Ithrite, Gareb the Ithrite, [41] Uriah the Hittite, Zabad the son of Ahlai, [42] Adina the son of Shiza the Reubenite, a leader of the Reubenites, and thirty with him, [43] Hanan the son of Maacah, and Joshaphat the Mithnite, [44] Uzzia the Ashterathite, Shama and Jeiel the sons of Hotham the Aroerite, [45] Jediael the son of Shimri, and Joha his brother, the Tizite, [46] Eliel the Mahavite, and Jeribai, and Joshaviah, the sons of Elnaam, and Ithmah the Moabite, [47] Eliel, and Obed, and Jaasiel the Mezobaite.\n\nFootnotes\n\n(1) 11:11 Compare 2 Samuel 23:8; Hebrew *thirty*, or *captains*\n\n(2) 11:14 Compare 2 Samuel 23:12; Hebrew *they . . . their*\n\n(3) 11:20 Syriac; Hebrew *three*\n\n(4) 11:21 Compare 2 Samuel 23:19; Hebrew *more renowned among the two*\n\n(5) 11:21 Syriac; Hebrew *three*\n\n(6) 11:22 Syriac; Hebrew *the son of a valiant man*\n\n(7) 11:23 A *cubit* was about 18 inches or 45 centimeters\n\n(8) 11:27 Compare 2 Samuel 23:25; Hebrew *the Harorite*\n\n(9) 11:34 Compare Septuagint and 2 Samuel 23:32; Hebrew *the sons of Hashem*\n (ESV)",
        "Psalm 96\n\nWorship in the Splendor of Holiness\n\n    [1] Oh sing to the LORD a new song;\n        sing to the LORD, all the earth!\n    [2] Sing to the LORD, bless his name;\n        tell of his salvation from day to day.\n    [3] Declare his glory among the nations,\n        his marvelous works among all the peoples!\n    [4] For great is the LORD, and greatly to be praised;\n        he is to be feared above all gods.\n    [5] For all the gods of the peoples are worthless idols,\n        but the LORD made the heavens.\n    [6] Splendor and majesty are before him;\n        strength and beauty are in his sanctuary.\n    \n    \n    [7] Ascribe to the LORD, O families of the peoples,\n        ascribe to the LORD glory and strength!\n    [8] Ascribe to the LORD the glory due his name;\n        bring an offering, and come into his courts!\n    [9] Worship the LORD in the splendor of holiness;(1)\n        tremble before him, all the earth!\n    \n    \n    [10] Say among the nations, “The LORD reigns!\n        Yes, the world is established; it shall never be moved;\n        he will judge the peoples with equity.”\n    \n    \n    [11] Let the heavens be glad, and let the earth rejoice;\n        let the sea roar, and all that fills it;\n    [12]     let the field exult, and everything in it!\n    Then shall all the trees of the forest sing for joy\n    [13]     before the LORD, for he comes,\n        for he comes to judge the earth.\n    He will judge the world in righteousness,\n        and the peoples in his faithfulness.\n    \n\nFootnotes\n\n(1) 96:9 Or *in holy attire*\n (ESV)",
        "Psalm 106\n\nGive Thanks to the LORD, for He Is Good\n\n    [1] Praise the LORD!\n    Oh give thanks to the LORD, for he is good,\n        for his steadfast love endures forever!\n    [2] Who can utter the mighty deeds of the LORD,\n        or declare all his praise?\n    [3] Blessed are they who observe justice,\n        who do righteousness at all times!\n    \n    \n    [4] Remember me, O LORD, when you show favor to your people;\n        help me when you save them,(1)\n    [5] that I may look upon the prosperity of your chosen ones,\n        that I may rejoice in the gladness of your nation,\n        that I may glory with your inheritance.\n    \n    \n    [6] Both we and our fathers have sinned;\n        we have committed iniquity; we have done wickedness.\n    [7] Our fathers, when they were in Egypt,\n        did not consider your wondrous works;\n    they did not remember the abundance of your steadfast love,\n        but rebelled by the sea, at the Red Sea.\n    [8] Yet he saved them for his name’s sake,\n        that he might make known his mighty power.\n    [9] He rebuked the Red Sea, and it became dry,\n        and he led them through the deep as through a desert.\n    [10] So he saved them from the hand of the foe\n        and redeemed them from the power of the enemy.\n    [11] And the waters covered their adversaries;\n        not one of them was left.\n    [12] Then they believed his words;\n        they sang his praise.\n    \n    \n    [13] But they soon forgot his works;\n        they did not wait for his counsel.\n    [14] But they had a wanton craving in the wilderness,\n        and put God to the test in the desert;\n    [15] he gave them what they asked,\n        but sent a wasting disease among them.\n    \n    \n    [16] When men in the camp were jealous of Moses\n        and Aaron, the holy one of the LORD,\n    [17] the earth opened and swallowed up Dathan,\n        and covered the company of Abiram.\n    [18] Fire also broke out in their company;\n        the flame burned up the wicked.\n    \n    \n    [19] They made a calf in Horeb\n        and worshiped a metal image.\n    [20] They exchanged the glory of God(2)\n        for the image of an ox that eats grass.\n    [21] They forgot God, their Savior,\n        who had done great things in Egypt,\n    [22] wondrous works in the land of Ham,\n        and awesome deeds by the Red Sea.\n    [23] Therefore he said he would destroy them—\n        had not Moses, his chosen one,\n    stood in the breach before him,\n        to turn away his wrath from destroying them.\n    \n    \n    [24] Then they despised the pleasant land,\n        having no faith in his promise.\n    [25] They murmured in their tents,\n        and did not obey the voice of the LORD.\n    [26] Therefore he raised his hand and swore to them\n        that he would make them fall in the wilderness,\n    [27] and would make their offspring fall among the nations,\n        scattering them among the lands.\n    \n    \n    [28] Then they yoked themselves to the Baal of Peor,\n        and ate sacrifices offered to the dead;\n    [29] they provoked the LORD to anger with their deeds,\n        and a plague broke out among them.\n    [30] Then Phinehas stood up and intervened,\n        and the plague was stayed.\n    [31] And that was counted to him as righteousness\n        from generation to generation forever.\n    \n    \n    [32] They angered him at the waters of Meribah,\n        and it went ill with Moses on their account,\n    [33] for they made his spirit bitter,(3)\n        and he spoke rashly with his lips.\n    \n    \n    [34] They did not destroy the peoples,\n        as the LORD commanded them,\n    [35] but they mixed with the nations\n        and learned to do as they did.\n    [36] They served their idols,\n        which became a snare to them.\n    [37] They sacrificed their sons\n        and their daughters to the demons;\n    [38] they poured out innocent blood,\n        the blood of their sons and daughters,\n    whom they sacrificed to the idols of Canaan,\n        and the land was polluted with blood.\n    [39] Thus they became unclean by their acts,\n        and played the whore in their deeds.\n    \n    \n    [40] Then the anger of the LORD was kindled against his people,\n        and he abhorred his heritage;\n    [41] he gave them into the hand of the nations,\n        so that those who hated them ruled over them.\n    [42] Their enemies oppressed them,\n        and they were brought into subjection under their power.\n    [43] Many times he delivered them,\n        but they were rebellious in their purposes\n        and were brought low through their iniquity.\n    \n    \n    [44] Nevertheless, he looked upon their distress,\n        when he heard their cry.\n    [45] For their sake he remembered his covenant,\n        and relented according to the abundance of his steadfast love.\n    [46] He caused them to be pitied\n        by all those who held them captive.\n    \n    \n    [47] Save us, O LORD our God,\n        and gather us from among the nations,\n    that we may give thanks to your holy name\n        and glory in your praise.\n    \n    \n    [48] Blessed be the LORD, the God of Israel,\n        from everlasting to everlasting!\n    And let all the people say, “Amen!”\n        Praise the LORD!\n    \n\nFootnotes\n\n(1) 106:4 Or *Remember me, O Lord, with the favor you show to your people; help me with your salvation*\n\n(2) 106:20 Hebrew *exchanged their glory*\n\n(3) 106:33 Or *they rebelled against God’s Spirit*\n (ESV)",
        "Acts 21\n\nPaul Goes to Jerusalem\n\n  [1] And when we had parted from them and set sail, we came by a straight course to Cos, and the next day to Rhodes, and from there to Patara.(1) [2] And having found a ship crossing to Phoenicia, we went aboard and set sail. [3] When we had come in sight of Cyprus, leaving it on the left we sailed to Syria and landed at Tyre, for there the ship was to unload its cargo. [4] And having sought out the disciples, we stayed there for seven days. And through the Spirit they were telling Paul not to go on to Jerusalem. [5] When our days there were ended, we departed and went on our journey, and they all, with wives and children, accompanied us until we were outside the city. And kneeling down on the beach, we prayed [6] and said farewell to one another. Then we went on board the ship, and they returned home.\n\n  [7] When we had finished the voyage from Tyre, we arrived at Ptolemais, and we greeted the brothers(2) and stayed with them for one day. [8] On the next day we departed and came to Caesarea, and we entered the house of Philip the evangelist, who was one of the seven, and stayed with him. [9] He had four unmarried daughters, who prophesied. [10] While we were staying for many days, a prophet named Agabus came down from Judea. [11] And coming to us, he took Paul’s belt and bound his own feet and hands and said, “Thus says the Holy Spirit, ‘This is how the Jews(3) at Jerusalem will bind the man who owns this belt and deliver him into the hands of the Gentiles.’” [12] When we heard this, we and the people there urged him not to go up to Jerusalem. [13] Then Paul answered, “What are you doing, weeping and breaking my heart? For I am ready not only to be imprisoned but even to die in Jerusalem for the name of the Lord Jesus.” [14] And since he would not be persuaded, we ceased and said, “Let the will of the Lord be done.”\n\n  [15] After these days we got ready and went up to Jerusalem. [16] And some of the disciples from Caesarea went with us, bringing us to the house of Mnason of Cyprus, an early disciple, with whom we should lodge.\n\nPaul Visits James\n\n  [17] When we had come to Jerusalem, the brothers received us gladly. [18] On the following day Paul went in with us to James, and all the elders were present. [19] After greeting them, he related one by one the things that God had done among the Gentiles through his ministry. [20] And when they heard it, they glorified God. And they said to him, “You see, brother, how many thousands there are among the Jews of those who have believed. They are all zealous for the law, [21] and they have been told about you that you teach all the Jews who are among the Gentiles to forsake Moses, telling them not to circumcise their children or walk according to our customs. [22] What then is to be done? They will certainly hear that you have come. [23] Do therefore what we tell you. We have four men who are under a vow; [24] take these men and purify yourself along with them and pay their expenses, so that they may shave their heads. Thus all will know that there is nothing in what they have been told about you, but that you yourself also live in observance of the law. [25] But as for the Gentiles who have believed, we have sent a letter with our judgment that they should abstain from what has been sacrificed to idols, and from blood, and from what has been strangled,(4) and from sexual immorality.” [26] Then Paul took the men, and the next day he purified himself along with them and went into the temple, giving notice when the days of purification would be fulfilled and the offering presented for each one of them.\n\nPaul Arrested in the Temple\n\n  [27] When the seven days were almost completed, the Jews from Asia, seeing him in the temple, stirred up the whole crowd and laid hands on him, [28] crying out, “Men of Israel, help! This is the man who is teaching everyone everywhere against the people and the law and this place. Moreover, he even brought Greeks into the temple and has defiled this holy place.” [29] For they had previously seen Trophimus the Ephesian with him in the city, and they supposed that Paul had brought him into the temple. [30] Then all the city was stirred up, and the people ran together. They seized Paul and dragged him out of the temple, and at once the gates were shut. [31] And as they were seeking to kill him, word came to the tribune of the cohort that all Jerusalem was in confusion. [32] He at once took soldiers and centurions and ran down to them. And when they saw the tribune and the soldiers, they stopped beating Paul. [33] Then the tribune came up and arrested him and ordered him to be bound with two chains. He inquired who he was and what he had done. [34] Some in the crowd were shouting one thing, some another. And as he could not learn the facts because of the uproar, he ordered him to be brought into the barracks. [35] And when he came to the steps, he was actually carried by the soldiers because of the violence of the crowd, [36] for the mob of the people followed, crying out, “Away with him!”\n\nPaul Speaks to the People\n\n  [37] As Paul was about to be brought into the barracks, he said to the tribune, “May I say something to you?” And he said, “Do you know Greek? [38] Are you not the Egyptian, then, who recently stirred up a revolt and led the four thousand men of the Assassins out into the wilderness?” [39] Paul replied, “I am a Jew, from Tarsus in Cilicia, a citizen of no obscure city. I beg you, permit me to speak to the people.” [40] And when he had given him permission, Paul, standing on the steps, motioned with his hand to the people. And when there was a great hush, he addressed them in the Hebrew language,(5) saying:\n\nFootnotes\n\n(1) 21:1 Some manuscripts add *and Myra*\n\n(2) 21:7 Or *brothers and sisters*; also verse 17\n\n(3) 21:11 Greek *Ioudaioi* probably refers here to Jewish religious leaders, and others under their influence, in that time\n\n(4) 21:25 Some manuscripts omit *and from what has been strangled*\n\n(5) 21:40 Or *the Hebrew dialect* (probably Aramaic)\n (ESV)"
    ]
}